jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
#include "stm32f4xx.h"
#include "uart5.h"
#include "network_handle.h"
#include "printer.h"
#include "delay.h"
#include "rtc.h"
#include "stdio.h"
#include "string.h"
#include "MsgHandle.h"
#include "sd.h"
#include "uart6.h"
#include "serialscreen.h"

static long Batch = 0x00 ;//交易流水号
__attribute__ ((aligned (4)))
unsigned char  TID[7] = {0xa2,0x00,0x04,0x10,0x00,0x00,0x13}; /*终端TID码：可修改*/
unsigned char  BRWN[7+3] = {0xa6,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0x00,0x00};	 /*交易流水线*/
unsigned char  BNO[6] = {0xa7,0x00,0x03,0x00,0x00,0x00};               /*批次号：可修改*/
unsigned char  DeviceArea[3+3]={0xac,0x00,0x03,0x17,0x03,0x02};         /*终端所在区域编号：可修改*/
unsigned char  DeviceAreaNO[4+3]={0xad,0x00,0x04,0x17,0x03,0x02,0x07};   /*终端所在地域编号：可修改*/
unsigned char  DeviceStatus[2+3]={0xae,0x00,0x02,0xE0,0x10};	   /*终端状态*/
unsigned char  DeviceTemperature[2+3]={0xdc,0x00,0x02,0x00,0x00};	   /*设备温度，最后的一个字节为温度*/
unsigned char  DeviceCoinsTotal[2+3]={0xde,0x00,0x02,0x00,0x00};	   /*机内硬币数，后两个字节存储的是机内*/
unsigned char  DealData[7]={0xa9,0x00,0x04,0x00,0x00,0x00,0x00};     /*交易日期*/
unsigned char  DealTime[6]={0xaa,0x00,0x03,0x00,0x00,0x00};       /*交易时间*/
unsigned char  MAC[8+3]={0xc9,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};   /*MAC*/
unsigned char  DealBalance[6+3]={0xb0,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};    /*交易金额*/
unsigned char  MealID[4+3] = {0xb1,0x00,0x04,0x10,0x00,0x00,0x20} ;                /*餐品ID  10000020*/
unsigned char  MealNO[1+3] = {0xb2,0x00,0x01,0x00};		   /*餐品购买数量*/
unsigned char  MealName[20+3] ={0xb3,0x00,0x14,'a','b','c','d','e','a','b','c','d','e','a','b','c','d','e','a','b','c','d','a'};  /*餐品名字*/
unsigned char  MealPrice[6+3]={0xbd,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};	  /*餐品价格*/
unsigned char  PayType[1+3]={0xbf,0x00,0x01,0x00};        /*支付方式*/
unsigned char  Change[6+3]={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00} ;        /*找零金额*/
unsigned char  RemainMealNum[2+3]={0xd8,0x00,0x02,0x00,0x00};  /*剩余餐品数量*/
unsigned char  MName[20+3]={0xa4,0x00,0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};             /*商户号MID*/
unsigned char  APPVersion[8+3]={ 0xc2,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};       /*应用程序版本*/
unsigned char  ParaFileVersion[8+3]={0xc3,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};   /*参数文件版本*/
unsigned char  BDataFileVersion[8+3]={0xc4,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};	/*业务数据文件版本*/
unsigned char  ChechStatus[2+3]={0xab,0x00,0x02,0x00,0x00};                                     /*自检状态*/
unsigned char  MID[3+3]={ 0xa3,0x00,0x03,0x10,0x00,0x01};                                       /*商户号MID*/
unsigned char  TTCount[3+2]     ={0xb7,0x00,0x02,0x00,0x00};	                                  /*交易总笔数 */
unsigned char  TNCT[6+3]        ={0xb8,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};                /*交易总金额*/
unsigned char  TNtype[3+2]      ={0xd9,0x00,0x02,0x00,0x00};											        /*交易总产品数 d9*/
unsigned char  TotalChange[3+6] ={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};					/*总找零金额 d7*/
unsigned char  TakeMealFlag[3+2]={0xdb,0x00,0x02,0x00,0x00};                              /*取餐标志 0x01:成功 0x02:失败 */
unsigned char  PosDevNum[10+3]=   {0xe0,0x00,0x0a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};                  /*刷卡器终端号*/
unsigned char  PosTenantNum[15+3]={0xe1,0x00,0x0f,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}; /*刷卡器商户号*/
unsigned char  PosBatchNum[10+3]= {0xe2,0x00,0x0a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};      /*交易流水号*/
unsigned char  PosUserNum[21+3]=  {0xe3,0x00,0x15,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};  /*用户银行卡号*/
unsigned char  UpdataFlag[3+1]=  {0xc1,0x00,0x01,0x00};                                     //更新标识
unsigned char  MenuNo[3+1]= {0xdd,0x00,0x01,0x01};                                        /*菜单编号,0x01,0x02,0x03,0x04,0x05（初步）*/
unsigned char  ACK[3+1]={0xc0,0x00,0x02,0x00};                                            //应答码
unsigned char  WordKeyCipher[11]={0xc7,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};//工作密钥

/*与后台进行数据交换的结构体：可修改*/
Meal_struction Meal[MealKindTotoal]={
						    /*餐品数量*/	 /*餐品ID*/ 			     /*餐品名字*/				    /*餐品价格*/			     /*餐品类型*/
								   0x00,0x00,	 0x10,0x00,0x00,0x41,  {"秘制猪手饭      "},   0x00,0x00,0x16,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x42,  {"潮氏卤鸡腿饭    "},   0x00,0x00,0x20,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x43,  {"特色稻香肉饭    "},   0x00,0x00,0x16,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x44,  {"黑椒猪扒饭      "},   0x00,0x00,0x16,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x45,  {"蒲烧鲷鱼饭      "},   0x00,0x00,0x20,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x46,  {"蒲烧秋刀鱼饭    "},   0x00,0x00,0x20,0x00, 	{"C001"},  
                   0x00,0x00,	 0x10,0x00,0x00,0x47,  {"咖喱鸡扒饭      "},   0x00,0x00,0x20,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x48,  {"梅菜扣肉饭      "},   0x00,0x00,0x16,0x00, 	{"C001"},
						   };
unsigned char	Record_buffer[254] = {0} ;
__attribute__ ((aligned (1)))
#define Discount  10  //定义折扣10折(不打折),5折(半价),0折(不要钱)

const char price_1st= 16*Discount/10; 
const char price_2nd= 20*Discount/10;
const char price_3rd= 16*Discount/10;
const char price_4th= 16*Discount/10;
const char price_5th= 20*Discount/10;
const char price_6th= 20*Discount/10;
const char price_7th= 20*Discount/10;
const char price_8th= 16*Discount/10;

/*屏幕显示的餐品名称*/
const char    mealname_1st[12]= {"秘制猪手饭"}; 
const char    mealname_2nd[14]= {"潮氏卤鸡腿饭"};
const char    mealname_3rd[14]= {"特色稻香肉饭"};
const char    mealname_4th[12]= {"黑椒猪扒饭"};
const char    mealname_5th[12]= {"蒲烧鲷鱼饭"};
const char    mealname_6th[14]= {"蒲烧秋刀鱼饭"};
const char    mealname_7th[12]= {"咖喱鸡扒饭"};
const char    mealname_8th[12]= {"梅菜扣肉饭"};

uint8_t Menu_interface= 0x00;
uint8_t MealSet_interface= 0x00;
uint8_t sell_type[4]={0};//存储四个菜品的的ID,在签到的时候需要获取的有当前需要显示售卖的哪一个界面和那几个餐品
/*与后台对应，套餐结构体装套餐所存的餐品ID，四个*/
uint8_t sell_type_1st[4]={0x01,0x02,0x03,0x04}; //第一个售餐菜单
uint8_t sell_type_2nd[4]={0x05,0x06,0x07,0x02}; //第二个售餐菜单
uint8_t sell_type_3rd[4]={0x03,0x04,0x05,0x06}; //第三个售餐菜单
uint8_t sell_type_4th[4]={0x05,0x06,0x01,0x02}; //第四个售餐菜单
uint8_t sell_type_5th[4]={0x05,0x06,0x01,0x02}; //第五个售餐菜单
 /*******************************************************************************
* Function Name  : GetBRWN
* Description    : 功能: 得到流水号
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
void GetBRWN(void)
{
   /*时间作为流水号*/
  RTC_TimeShow();
	BRWN[3] =    20 /10 *16 + 20%10 ;	        /*年*/
	BRWN[4] =    TimeDate.Year /10 *16 +  TimeDate.Year%10 ;
	BRWN[5] =    TimeDate.Month /10 *16 + TimeDate.Month%10 ;
	BRWN[6] =    TimeDate.Date /10 *16 +  TimeDate.Date%10 ;
	BRWN[7] =    TimeDate.Hours /10 *16 + TimeDate.Hours%10 ;
	BRWN[8] =    TimeDate.Minutes /10 *16 + TimeDate.Minutes%10 ;
	BRWN[9] =    TimeDate.Senconds /10 *16 + TimeDate.Senconds%10 ;
}

