jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
/*******************************************************************************
* Function Name  : GetCrc16
* Description    : 进行CRC校验
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
unsigned int GetCrc16(unsigned char *bufData,unsigned int sizeData)
{
  unsigned int Crc ,i = 0;
	unsigned char j = 0;
	if(sizeData == 0)
	  return 1 ;
	Crc = 0 ;
	for(i=0;i<sizeData;i++)
	{
	  Crc ^= bufData[i];
	  for(j=0;j<8;j++)
	  {
	    if(Crc&0x0001)
		  {
		    Crc >>=1 ;
		    Crc ^=0x08408 ;
		  }
		  else
		    Crc >>=1 ;
	  }
	}
	return Crc ;
}

/*---------------------------------------------------------------------------
void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf);
功能: 将一个 16bit 的整数转换成 Buffer 数据, 高位在前
高位在前
*/
void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf)
{
    ret_buf[0] = (unsigned char)(int_v >> 8);  // [0] 对应 --> 高位
    ret_buf[1] = (unsigned char)(int_v & 0xff);

}
/*---------------------------------------------------------------------------
 uint16_t HL_BufferToInt(const unsigned char *in_buf);
 功能: 将缓冲区数据转换成整数, 高位在前
 高位在前
*/
uint16_t HL_BufferToInit(const unsigned char *in_buf)
{
    uint16_t ret_n;
    ret_n = in_buf[0];           // 取高位
    ret_n = (ret_n << 8);
    ret_n += in_buf[1];          // 取低位
    return ret_n;
}

/*---------------------------------------------------------------------------
uint32_t HL_BufferToLong(const unsigned char *in_buf);
功能: 将 (unsigned char *) 数据转换成 Long 型, 高位在前
高位在前
*/
uint32_t HL_BufferToLong00(const unsigned char *in_buf)
{
    uint32_t ret_n;

    ret_n = in_buf[0];     // 最高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[1];    // 次高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[2];    // 高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[3];    // 低位

    return ret_n;
}

/*---------------------------------------------------------------------------
void LH_LongToBuffer(uint32_t in_n, unsigned char *ret_buf);
功能: 将长整数转换成 unsigned char 型数据, 高位在前
*/
void HL_LongToBuffer00(const uint32_t in_n, unsigned char *ret_buf)
{
    ret_buf[0] = (unsigned char)((in_n >> 24) & 0xff);   // [0] 对应 --> 高位
    ret_buf[1] = (unsigned char)((in_n >> 16) & 0xff);
    ret_buf[2] = (unsigned char)((in_n >> 8) & 0xff);
    ret_buf[3] = (unsigned char)(in_n & 0xff);
}
 //---------------------------------------------------------------------------
// 功能: 将缓冲区清零
/*******************************************************************************
* Function Name  : mem_set_00
* Description    : 功能: 将缓冲区清零
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
static void mem_set_00(unsigned char *dest, const long s_len)
{
    long j0;

    for(j0 = 0; j0 < s_len; j0++)  dest[j0] = 0;
}


//---------------------------------------------------------------------------
// 功能: 字符串拷贝
/*******************************************************************************
* Function Name  : mem_set_00
* Description    : 功能: 将缓冲区清零
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
uint16_t mem_copy01(unsigned char *dest, const unsigned char *source, const long s_len)
{
  long j0;
  for(j0 = 0; j0 < s_len; j0++)  dest[j0] = source[j0];
  dest[j0++]=',';
  return (s_len+1);
}
uint16_t mem_copy00(unsigned char *dest, const unsigned char *source, const long s_len)
{
  long j0;
  for(j0 = 0; j0 < s_len; j0++)  dest[j0] = source[j0];
  return (s_len);
}

/*********************/
typedef struct
{
  unsigned char  Lenght[2] ;
  unsigned char  MealNO[35*4];    /*餐品具体数目*/

}ReturnData_Struction;
ReturnData_Struction  ReturnData;

  /*******************************************************************************
* Function Name  : CheckResponseCode
* Description    : 检查返回码看什么错误
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char CheckResponseCode(unsigned char Cmd)
{
// unsigned char  i = 0 ;
  switch(Cmd)
  {
		case 0x00 : /*交易成功*/
			return 0 ;
		case 0x01 : /*包CRC错误*/
			return 1 ;
		case 0x02 : /*包CRC错误*/
				break;
		case 0x03 : /*无效的终端类型*/
				break  ;
		case 0x04 : /*协议版本错误*/
				break ;
		case 0x05 : /*无效的终端SN*/
				break;
		case 0x06 : /*无效的商户号(MID)*/
				break;
		case 0x07 :	/*无效文件偏移地址*/
				break ;
		case 0x08 : /*无效文件偏移地址*/
				break ;
		case 0x09 : /*其他包内容错误*/
				break;
		case 10 :	/*商户号与设备号对应关系错误*/
				break ;
		case 11 : /*餐品数据对比不一致*/
					 {
					 }
				break ;
		case 12 : /*后台不存在设备区域ID、所在点ID信息*/
				break;
		case 13 : /*设备上送的区域ID、所在点ID信息与后台不匹配*/
				break ;
		case 14 : /*设备上送餐品信息格式不正确*/
				break ;
		case 15 :  /*取餐交易（批次号、流水号）重复*/
				break;
		case 16 : /*终端上送的餐品数据里某餐品信息不存在于后台数据库*/
				break;
		case 17 : /*批上送日志格式不正确*/
				break;
		case 20 :  /*无效金额*/
				break;
		case 21 : /*原始金额错误*/
				break;
		case 22 : /*无效餐品ID号*/
				break;
		case 23 : /*购买数量无效*/
				break ;
		case 0x24 : Batch ++ ;
				break;
		case 30: /*密码错*/
				 break ;
		case 31 : /*账户内余额不足*/
				 break;
		case 40 : /*锁定终端*/
				 break;
		case 41 : /*解锁终端*/
				 break ;
		case 50 : /*后台文件版本不存在*/
				 break;
		case 51 :/*请求文件版本与后台发布的文件版本不一致*/
					break ;
		case 96 : /*后台系统错误*/
					break ;
		default :break;
  }
	return 3; /*后来加的防止有waring*/
}
 /*******************************************************************************
* Function Name  : GetData
* Description    : 得到相应命令的数据
* Input          : unsigned char *dest,unsigned char *souce,const long s_len,unsigned char Cmd
* Output         : void
* Return         : void
*******************************************************************************/
long  GetData(unsigned char *dest,unsigned char *souce, long s_len,unsigned char Cmd)
{
	long i = 0 ,j=0,Cmdlenght=0;
	for(i=0;i<s_len;i++)
	{
	  if(souce[i] == Cmd)	 /*得到命令*/
	  {
		  Cmdlenght= HL_BufferToInit(&souce[i+1]);    /*得到数据长度*/
//		printf("Cmdlenght=%d\r\n",Cmdlenght);
		  for(j=0;j<Cmdlenght;j++)				      /*得到数据  */
		  {
			  dest[j] = souce[i+j+3] ;
//			printf("dest[%d]=%x\r\n",j,dest[j]);
		  }
		  return Cmdlenght  ;
		}
	}
	return 0 ;
}
 /*******************************************************************************
* Function Name  : CmdDataSend
* Description    : 发送数据函数
* Input          : unsigned char *p  long Lenght
* Output         : void
* Return         : void       ok
*******************************************************************************/
static void CmdDataSend(unsigned char *p,long Lenght)
{
  uint16_t i=0;
	 /*初始化*/
 	F_RX1_SYNC = 0;
	rx1BufIndex = 0;
	F_RX1_VAILD = 1;
	CrcValue = 0;
	F_RX1_Right = 0 ;
	for(i=0;i<Lenght;i++)
	{
	  UART5->DR = (u8) p[i];
    while((UART5->SR&0X40)==0);//循环发送,直到发送完毕
	  //delay_ms(5);
	  //printf(" p[%d]=%x\r\n", i,p[i]);
	}
}

unsigned char  MealComparefunDemo(long Cmd ,unsigned char *p,unsigned long lenght)
{
  uint16_t  CRCValue= 0 ;
// static  int Bno = 0 ;
  unsigned char Waittimeout = 250 ;
  /*给数组赋值命令*/
  HL_IntToBuffer(Cmd,&p[1]);
  /*数组长度*/
  HL_IntToBuffer(lenght-8,&p[3]);
  /*得到数据的CRC*/
  CRCValue=GetCrc16(&p[1],lenght-4);
  /*把CRC赋值到数组中*/
  HL_IntToBuffer(CRCValue,&p[lenght-2]);
  /*发送命令*/
  CmdDataSend(p,lenght);	//发送数据
  /*等待数据返回*/
  while(--Waittimeout)
	{
		delay_ms(10);
		if(F_RX1_Right) //接收到有限数据CRC正确
		{
		  F_RX1_Right = 0 ;
		  break;
		}
  }
  if(Waittimeout == 0 )
		return 1 ;//超时返回1
  return 0 ;
}


