jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
/*******************************************************************************
发送签到后，返回给终端的结构体数据
*******************************************************************************/
/*******************************************************************************
* Function Name  : 签到 	 0X0100
* Description	 :签到
* Input 		 : void
* Output		 : void
* Return		 : char
* Time	       :2014-4-7  MrLao  ok
*******************************************************************************/

unsigned char  SignInFun(void)
{
	unsigned char i = 0 ;
	 long  Command = 0x0100 ;
	 long  Lenght = 0,j = 0  ;
	 long  CmdLenght = 0 ;  //命令长度
	 unsigned char  Send_Buf[400]={0};
	 mem_set_00(rx1Buf,sizeof(rx1Buf));	 //数据清零

	/* 命令包 ++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));      /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MID,sizeof(MID));  /*商户号TID 命令(1)+数据长度(2)+数据     100001*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MName,sizeof(MName));  /*商户名称*/
	GetBRWN();														 /*得到流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));   /*交易流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));     /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],APPVersion,sizeof(APPVersion)); /*应用程序版本号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ParaFileVersion,sizeof(ParaFileVersion)); /*参数文件版本号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BDataFileVersion,sizeof(BDataFileVersion)); /*业务数据文件版本号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ChechStatus,sizeof(ChechStatus)); /*自检状态*/
 	Send_Buf[CmdLenght] = 0x03 	;
 	CmdLenght+=0x03;
	 /*发送命令*/
     i = MealComparefunDemo(Command,Send_Buf,CmdLenght);
	  /***************************************************************************/
 	if(i == 0x01)	 //
 	 return 1;
	Lenght = HL_BufferToInit(&rx1Buf[2]);	 //判断数据长度是否
	if(Lenght == 0x00)
	 return  1 ;
	 for(i=0;i<23;i++)
	 {
	   MName[i] = rx1Buf[i+4];//得到商幻
	 }
	 for(i=0;i<3;i++)
	 {
	   BNO[i+3] = rx1Buf[i+27+3];//得到批次号
	 }
	 for(i=0;i<11;i++)
	 {
	   APPVersion[i] = rx1Buf[i+0x21];//得到程序版本号
	 }
	 for(i=0;i<11;i++)
	 {
	   ParaFileVersion[i] = rx1Buf[i+0x2c];//得到参数文件版本
	 }
	 for(i=0;i<11;i++)
	 {
	   BDataFileVersion[i] = rx1Buf[i+0x37];//业务数据版本文件
	 }
	 for(i=0;i<4;i++)
	 {
	   UpdataFlag[i] = rx1Buf[i+0x42];//得到批次号
	 }
	 for(i=0;i<4;i++)
   {
      MenuNo[i]= rx1Buf[i+0x46];
      //printf("%X ",MenuNo[i]);
   }
   if(MenuNo[0]!=0xdd)  return 1; 
	 for(i=0;i<4;i++)
	 {
	   ACK[i] = rx1Buf[i+0x4A];//得到
	 }
	 for(i=0;i<11;i++)
	 {
	   WordKeyCipher[i] = rx1Buf[i+0x4E];//得到工作密文
	 }
   for(i=0;i<11;i++)
	 {
	   MAC[i] = rx1Buf[i+0x59];
	 }
   if(ACK[3]==0x24)
	 {
	   return 1 ;
	 }
   return 0 ;
}

void StructCopyToBuffer(unsigned char *dest)
{
  long j0=0,i=0,k=0;
//上传4份餐品的数据
  for(j0 = 0; j0 < 4; j0++)
	{
	  for(i=0;i<4;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealID[i];
		
	  for(i=0;i<20;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealName[i];

		dest[k++]= Meal[sell_type[j0]-1].MealNum[0]; //第一个数为0
	  dest[k++]= DefineMeal[sell_type[j0]-1].MealCount; //第二个数为餐品的数量

	  for(i=0;i<4;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealPreace[i];

	  for(i=0;i<4;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealType[i];
	}
}

/*******************************************************************************
* Function Name  : 餐品数据对比		 0X0200
* Description    :餐品数据对比
* Input          : void
* Output         : void
* Return         : char
* Time          :2014-4-7  MrLao   数据域采用TVL格式
*******************************************************************************/
unsigned char k = 0 ;
MealCompareDataStruct MealCompareData;
uint32_t  MealDataCompareFun(void)
{
  
 	unsigned char i= 0 ;
  long  Lenght = 0 ,j;
//	unsigned char MealID = 0 ;
	long  CmdLenght = 0 ;
	unsigned char status = 0 ;
	unsigned char Send_Buf[400];
	unsigned char TempBuffer[35*4]={0};
	unsigned char Buffer[306]={0};
	mem_set_00(rx1Buf,sizeof(rx1Buf));

	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN(); /*得到水流号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));                   /*交易流水线*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));                     /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));       /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO));   /*终端所在地域编号*/
 	Send_Buf[CmdLenght] =  0xbc ;	 //T  餐品数据对比， 数据域采用TVL格式
	Send_Buf[CmdLenght+1] =  0x01 ;	 //L 数据长度
	Send_Buf[CmdLenght+2] =  0x32 ;	  //V 数据内容
	CmdLenght += 3;
	StructCopyToBuffer(Buffer);
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Buffer,sizeof(Buffer));

	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;

	/*发送命令*/
  i = MealComparefunDemo(0x0200,Send_Buf,CmdLenght);

/***************************************************************************/
  MealCompareData.MealCompareTotoal= 0; 
    /*单片是否成功*/
	if(i==0x01) //超时
	{		
		return MealCompareData.MealCompareTotoal; 
	}
	
	Lenght = HL_BufferToInit(&rx1Buf[2]);		//得到数据长度
	GetData(&ReturnData.Lenght[0],rx1Buf,Lenght,0xc0);	  /*返回状态*/
	
 	//printf("Status=%x\r\n",ReturnData.Lenght[0]);

	if(ReturnData.Lenght[0] == 0x00 )
	{
		MealCompareData.MealCompareTotoal= 0xFFFFFFFF;	
	    return MealCompareData.MealCompareTotoal;	 /*数据正确*/
	} 
	if(ReturnData.Lenght[0] == 0x24 )
	{
		MealCompareData.MealCompareTotoal= 0xFFFFFFFF;	
	    return MealCompareData.MealCompareTotoal;	 /*数据正确*/
	}
	CmdLenght = GetData(TempBuffer,rx1Buf,Lenght,0xBC);/*餐品对比*/
  //printf("StatusCmdLenght=%x\r\n",CmdLenght);
	if(CmdLenght>34)
	{
	  status  = CmdLenght / 35  ;
		for(i=0;i<4;i++)
		{
			if(rx1Buf[45+i*35]==0x04)   //餐品对比标志
			{
				MealCompareData.MealComparePart[i]=0xFF;
			}					
			else
			{
				MealCompareData.MealComparePart[i]=rx1Buf[36+i*35];
		  }				
		}
		return MealCompareData.MealCompareTotoal ;/*餐品对比信息*/
	}
  MealCompareData.MealCompareTotoal=0;
  return MealCompareData.MealCompareTotoal;
}



