jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
/*******************************************************************************
* Function Name  : 2.3.3 签退		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char SignOutFun()
{

 	unsigned char i = 0 ;
  long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[400];

  mem_set_00(rx1Buf,sizeof(rx1Buf));
  /*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN(); /*得到水流号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
  i = MealComparefunDemo(0x0300,Send_Buf,CmdLenght);

	if(i == 0x01)
	return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]);
	 for(j=0;j<Lenght+7;j++)
	 {
//	 printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }
   return 0 ;
}

 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0400
* Description    :状态函数
* Input          : void
* Output         : void
* Return         : void         ok
*******************************************************************************/
unsigned char StatusUploadingFun(uint16_t erro_status)
 {

	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j;
	 long	 CmdLenght = 0 ;
   uint8_t Temperature_t=0;
   uint16_t CoinsTotoal_t=0;
   uint8_t  Temperature_tt[5]={0};
   uint8_t  CoinsTotoal_tt[5]={0};
	 uint8_t	Send_Buf[400]={0};
	 uint8_t  state_temp[2]={0};  
	 //sprintf(state_temp,"%x",erro_status); 
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 /*水流号++*/
	 Send_Buf[0] =	0x02 ;
	 Send_Buf[1] =	0x00 ;
	 Send_Buf[2] =	0x00 ;
	 Send_Buf[3] =	0x00 ;
	 Send_Buf[4] =	0x00 ;
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 GetBRWN(); /*得到水流号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 
   state_temp[1]=(erro_status&0x00ff);
	 state_temp[0]=(erro_status>>8)&0x00ff;
	 for(i=0;i<3;i++) 
	 {
		 DeviceStatus[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceStatus,sizeof(DeviceStatus));  /*终端的状态*/
   Temperature_t= Temperature;
   state_temp[1]=(Temperature_t&0x00ff);
	 state_temp[0]=(Temperature_t>>8)&0x00ff;
   memcpy(Temperature_tt,DeviceTemperature,sizeof(DeviceTemperature));
	 for(i=0;i<3;i++) 
	 {
		 Temperature_tt[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Temperature_tt,sizeof(Temperature_tt));  /*终端的温度*/
   CoinsTotoal_t =CoinsTotoalMessageWriteToFlash.CoinTotoal;
   state_temp[1]=(CoinsTotoal_t&0x00ff);
	 state_temp[0]=(CoinsTotoal_t>>8)&0x00ff;   
   memcpy(CoinsTotoal_tt,DeviceCoinsTotal,sizeof(DeviceCoinsTotal));  
	 for(i=0;i<3;i++) 
	 {
		 CoinsTotoal_tt[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],CoinsTotoal_tt,sizeof(CoinsTotoal_tt));  /*终端的硬币数*/   
	 Send_Buf[CmdLenght] = 0x03  ;
	 CmdLenght+=0x03;
	 i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);//0x0400 状态上送
	 if(i == 0x01)
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
  
 //   printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);

	 }
   return 0 ;

 }

 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0400
* Description    :状态函数
* Input          : void
* Output         : void
* Return         : void         ok
*******************************************************************************/
unsigned char TemperatureUploadingFun(uint8_t Temperature_t)
 {

	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j;
	 long	 CmdLenght = 0 ;
	 unsigned char	Send_Buf[400]={0};
	 char  state_temp[2]={0};
   char  Temperature_tt[5]={0};
	 //sprintf(state_temp,"%x",erro_status); 
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 /*水流号++*/
	 Send_Buf[0] =	0x02 ;
	 Send_Buf[1] =	0x00 ;
	 Send_Buf[2] =	0x00 ;
	 Send_Buf[3] =	0x00 ;
	 Send_Buf[4] =	0x00 ;
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 GetBRWN(); /*得到水流号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/ 
   state_temp[1]=(Temperature_t&0x00ff);
	 state_temp[0]=(Temperature_t>>8)&0x00ff;
   memcpy(Temperature_tt,DeviceTemperature,sizeof(DeviceTemperature));
	 for(i=0;i<3;i++) 
	 {
		 Temperature_tt[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Temperature_tt,sizeof(Temperature_tt));  /*终端的状态*/
	 Send_Buf[CmdLenght] = 0x03  ;
	 CmdLenght+=0x03;
	 i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);//0x0400 状态上送
	 if(i == 0x01)
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
  
 //   printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);

	 }
   return 0 ;

 }
 /*******************************************************************************
* Function Name  : 回响测试	 0X0700
* Description    :回响测试
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char EchoFun(void)
{

 	unsigned char i = 0 ;
	long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[100];
	mem_set_00(rx1Buf,sizeof(rx1Buf));
    /*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealData,sizeof(DealData));  /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealTime,sizeof(DealTime));  /*终端的TID*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
  i = MealComparefunDemo(0x0700,Send_Buf,CmdLenght);
	if(i == 0x01)  // 返回数据超时
	  return 1 ;

	USART_ITConfig(UART5,USART_IT_RXNE,DISABLE);
  Lenght = HL_BufferToInit(&rx1Buf[2]) ;

	if(Lenght == 0x00)
	{
	  USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);
	  return 1 ;
	}
	for(j=0;j<Lenght+7;j++)
	{
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	 {
		 //  tmp_yy  = rx1Buf[7]/16*10+rx1Buf[7]%16 ;/*年*/
		   tmp_yy  = rx1Buf[8]/16*10+rx1Buf[8]%16 ;/*年*/
       if(tmp_yy<14) return 1 ;// 以免年份出错
//		   printf("tmp_yy=%d\r\n",tmp_yy);
		   tmp_m2  = rx1Buf[9]/16*10+rx1Buf[9]%16 ;/*月*/
//		   printf("tmp_yy=%d\r\n",tmp_m2);
		   tmp_dd  = rx1Buf[10]/16*10+rx1Buf[10]%16 ;/*日*/
//		   printf("tmp_dd=%d\r\n",tmp_dd);

		   tmp_hh  = rx1Buf[14]/16*10+rx1Buf[14]%16 ;/*时*/
		   tmp_mm  = rx1Buf[15]/16*10+rx1Buf[15]%16 ;/*分*/
		   tmp_ss  = rx1Buf[16]/16*10+rx1Buf[16]%16 ;/*秒*/

		   rx1Buf[7]  = rx1Buf[7]/16*10+rx1Buf[7]%16 ;/*年*/
		   rx1Buf[8]  = rx1Buf[8]/16*10+rx1Buf[8]%16 ;/*年*/
		   rx1Buf[9]  = rx1Buf[9]/16*10+rx1Buf[9]%16 ;/*月*/
		   rx1Buf[10]  = rx1Buf[10]/16*10+rx1Buf[10]%16 ;/*日*/

		   rx1Buf[14]  = rx1Buf[14]/16*10+rx1Buf[14]%16 ;/*时*/
		   rx1Buf[15]  = rx1Buf[15]/16*10+rx1Buf[15]%16 ;/*分*/
		   rx1Buf[16]  = rx1Buf[16]/16*10+rx1Buf[16]%16 ;/*秒*/
//		   for(i=0;i<4;i++)
//		   printf("rx1Buf[%d]=%d\r\n",i,rx1Buf[i+7]);

//		   for(i=0;i<3;i++)
//		   printf("rx1Buf[%d]=%d\r\n",i,rx1Buf[i+14]);

		 USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);
	  return 0 ;
	 }

	 	 USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);
    return 1 ;

