jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
}


 /*******************************************************************************
* Function Name  : 取餐发送数据  OK
* Description    : 取餐发送数据
* Input          : void
* Output         : void
* Return         : void
    08 10 00 0f c0 00 01 24 c9 00 08 00 00 00 00 00 00 00 00 03 e8 47
   //应答码 2位          MAC 8位
*******************************************************************************/

CustomerSel__struction CustomerSel;
unsigned char TakeMealsFun(unsigned char *SendBuffer,unsigned char takeout_flag)
 {
	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j=0;
	 long  CmdLenght = 0 ;
	 unsigned char	   Send_Buf[1024];	//要发送的数据啦
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 /*水流号++*/
	 Send_Buf[0] =	0x02 ;
	 Send_Buf[1] =	0x00 ;
	 Send_Buf[2] =	0x00 ;
	 Send_Buf[3] =	0x00 ;
	 Send_Buf[4] =	0x00 ;
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 GetBRWN();
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
	 for(i=0;i<6;i++)
	 {
	   DealBalance[3+i] = CustomerSel.DealBalance[i] ;
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealBalance,sizeof(DealBalance)); /*交易金额(支付金额) */

	 for(i=0;i<4;i++)
	 {
	  //这里赋值餐品的ID
	   MealID[3+i] = CustomerSel.MealID[i] ; //(10000020)
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealID,sizeof(MealID)); /*餐品ID*/

	 /*这里赋值餐品的ID*/
	 MealNO[3] = CustomerSel.MealNo;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealNO,sizeof(MealNO)); /*餐品购买数量*/

	  //这里赋值餐品的名字
	 for(j=0;j<20;j++)
	   MealName[3+j]=Meal[CustomerSel.MealName-1].MealName[j];

	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealName,sizeof(MealName));			  /*餐品名字*/

	 /*这里赋值餐品的价格*/
	 for(i=0;i<6;i++)
	 MealPrice[3+i] = CustomerSel.MealPrice[i] ;

	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));			/*餐品价格*/
	/*付钱的方式*/
	 PayType[3] = CustomerSel.PayType ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,sizeof(PayType));				/*支付方式*/
	 /*找零金额*/
	 for(i=0;i<6;i++)
	 Change[3+i] = CustomerSel.Change[i] ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change)); 			   /*找零金额*/
	 /*剩余餐品数量*/
	 for(i=0;i<2;i++)
	 {
	  RemainMealNum[3+i] = CustomerSel.RemainMealNum[i] ;
    //printf("CustomerSel.RemainMealNum[i]=%d\r\n",CustomerSel.RemainMealNum[i]);
	 }
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/
   TakeMealFlag[4]= takeout_flag;
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TakeMealFlag,sizeof(TakeMealFlag)); /*取餐标记*/ 
   if(UserActMessageWriteToFlash.UserAct.PayType != '1')
   {     
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosDevNum,PosDevNum[2]+3); /*刷卡器终端号*/
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosTenantNum,PosTenantNum[2]+3); /*刷卡器商户号*/   
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosBatchNum,PosBatchNum[2]+3); /*刷卡器交易流水号*/
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosUserNum,PosUserNum[2]+3); /*用户银行卡号*/
   }
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));					  /*MAC*/
	 Send_Buf[CmdLenght] = 0x03  ;  //包含数据包包尾标识和CRC校验码
	 CmdLenght+=0x03;
   i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght); //发送数据(取餐交易)
   mem_copy00(SendBuffer, Send_Buf,CmdLenght);	//把发送的参数传入数组写入SD卡
 /***************************************************************************/
	 HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);	/*保存数据的长度*/

	 if(i == 0x01) /*判断是否超时*/
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 if(Lenght == 0x00)/*判断数据长度*/
	 return 1 ;
	 for(j=0;j<Lenght+7;j++)
	 {
     //printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)  //表示正确
	 {
		 if(rx1Buf[7]==0x00)/*是否应答命令*/
		 {
			  return 0 ;
		 }
		 if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		 {
		 //   Batch ++ ;	/*流水号自加*/
			 return 1 ;
		 }
	 }
   return 0 ;
}

 /*******************************************************************************
* Function Name  : MealUploadingFun		 0X0300
* Description    : 餐品上送
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char MealUploadingFun(void)
{
  unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	unsigned char 	  Send_Buf[400];
	long  CmdLenght = 0 ;
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN();
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC)); /*MAC*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
	i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);
	if(i == 0x01)
	  return 1 ;
  Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	for(j=0;j<Lenght+7;j++)
	{
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	return 0 ;
 }



 /*******************************************************************************
* Function Name  : MealGroupUploadingFun		 披上送
* Description    : 餐品披上送
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/

typedef struct
{
  unsigned char  BRWN[3];           /*交易流水线*/
  unsigned char  MealID[4];         /*餐品ID*/
  unsigned char  DealBalance[6];    /*交易金额*/
  unsigned char  MealNO;		    /*餐品购买数量*/
  unsigned char	 RemainMealNum[2];  /*剩余餐品数量*/
  unsigned char  MealPrice[6];	    /*餐品价格*/
  unsigned char  PayType;           /*支付方式*/
  unsigned char  Change[6];         /*找零金额*/
  unsigned char  TimeData[7];		/*购买的时间*/
}MealGroup_struction;
 MealGroup_struction 	 MealGroup[9]={		/*交易流水线*/ /*餐品ID*/		  /*交易金额*/            /*餐品购买数量*/    /*剩余餐品数量*/		/*餐品价格*/	  /*支付方式*/			/*找零金额*/			  /*购买的时间*/
                                         {0x00,0x00,0x01, 0x10,0x00,0x00,0x20, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,   0x00,0x00,   0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
                                       	 {0x00,0x00,0x02, 0x10,0x00,0x00,0x21, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x03, 0x10,0x00,0x00,0x22, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x04, 0x10,0x00,0x00,0x23, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x05, 0x10,0x00,0x00,0x24, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x06, 0x10,0x00,0x00,0x25, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x07, 0x10,0x00,0x00,0x26, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x08, 0x10,0x00,0x00,0x27, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x09, 0x10,0x00,0x00,0x28, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
									    };

void StructCopyToBuffer00(unsigned char *dest,unsigned char index)
{

  long i=0,k=0;
  for(i=0;i<3;i++)
	{
	  dest[k++]=MealGroup[index].BRWN[i];
	}
	for(i=0;i<4;i++)
	{
	  dest[k++]=MealGroup[index].MealID[i];
	}
	for(i=0;i<6;i++)
	{
	  dest[k++]=MealGroup[index].DealBalance[i];
	}
	dest[k++]=MealGroup[index].MealNO;
	for(i=0;i<2;i++)
	{
	   dest[k++]=MealGroup[index].RemainMealNum[i];
	}
	for(i=0;i<6;i++)
	dest[k++]=MealGroup[index].MealPrice[i];
	dest[k++]=MealGroup[index].PayType;
	if(MealGroup[index].PayType==0x01)
	{
	  for(i=0;i<4;i++)
	  dest[k++]=MealGroup[index].Change[i];
	}
 	for(i=0;i<6;i++)
	dest[k++]=MealGroup[index].TimeData[i];
}

