jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
unsigned char MealGroupUploadingFun(void)
{
  unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	long  CmdLenght = 0 ;
	unsigned char 	 Send_Buf[500];
	unsigned char    Buffer[327]={0x00,0x00,0x0a};
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	  GetBRWN();

	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
 	Send_Buf[CmdLenght]   =  0xbb ;	   //T
	Send_Buf[CmdLenght+1] =  0x01 ;	   //L
	Send_Buf[CmdLenght+2] =  0x44 ;	   //V
	CmdLenght += 3;

	 StructCopyToBuffer00(&Buffer[3],0);
	 StructCopyToBuffer00(&Buffer[3+0x24],1);
	 StructCopyToBuffer00(&Buffer[3+0x24*2],2);
	 StructCopyToBuffer00(&Buffer[3+0x24*3],3);
	 StructCopyToBuffer00(&Buffer[3+0x24*4],4);
	 StructCopyToBuffer00(&Buffer[3+0x24*5],5);
	 StructCopyToBuffer00(&Buffer[3+0x24*6],6);
	 StructCopyToBuffer00(&Buffer[3+0x24*7],7);
	 StructCopyToBuffer00(&Buffer[3+0x24*8],8);

   printf("%x\r\n",sizeof(MealGroup_struction));
 	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Buffer,sizeof(Buffer));  /*批次号*/
	 Send_Buf[CmdLenght] = 0x03 	;
	 CmdLenght+=0x03;
	/*
	 这里添加没有上传的产品名字
	*/
	 i = MealComparefunDemo(0x0500,Send_Buf,CmdLenght);
	 if(i == 0x01)
	 return 1 ;
     Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }
	 return 0 ;
}
  /*******************************************************************************
* Function Name  : ClearingFun		 披上送
* Description    :
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char    ClearingFun(void)
{
  unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	unsigned char 	  Send_Buf[400];
	long  CmdLenght = 0 ;
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/

  GetBRWN();
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC)); /*MAC*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
	i = MealComparefunDemo(0x0500,Send_Buf,CmdLenght);
	if(i == 0x01)
	  return 1 ;
  Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	for(j=0;j<Lenght+7;j++)
	{
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	return 0 ;
}

 /*******************************************************************************
* Function Name  : SignInFunction
* Description    : 签到函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
bool SignInFunction(void)
{
   
  unsigned char i = 50 ;
    do
	{
	  if(SignInFun()==0x00)
	  break;
	  delay_ms(100);
	}while(--i);

	if(i == 0x00)
	  return false;
	else
		return true;
}	
    

/*******************************************************************************
   * 函数名称:StateSend
   * 描    述:状态上送
   *
   * 输    入:无
   * 输    出:无
   * 返    回:void
   * 修改日期:2014年4月4日		ok
   *******************************************************************************/
  uint32_t statesend_record=0;//用来防止多次传输
  void StateSend(void)
  {
	  RTC_TimeShow();//获得时间
	  switch(TimeDate.Minutes)
		{
      case 5:
			case 10:
//			case 12:
//			case 14:
			case 15:						
//	    case 18:
//		  case 19:								
			case 20:
//			case 22:
			case 25:
//			case 26:
//			case 28:
			case 30:
//			case 32:
			case 35:
//			case 36:
//			case 38:
			case 40:
//			case 42:
			case 45:
//			case 46:
//			case 48:				
			case 50:
//			case 52:
			case 55:
//			case 56:
			case 0:				
			{
			  if(TimeDate.Senconds==10) //控制多次传输
			  {
          StatusUploadingFun(0xE800); //状态上送
//          if(statesend_record!=TimeDate.Senconds)
//          {
//             statesend_record= TimeDate.Senconds;
//             StatusUploadingFun(0xE800); //状态上送
//          }  
			  }
			  break;
			}
		  default : break;
		}
  }

  /*******************************************************************************
* Function Name  : SignInFunction
* Description    : 数据回响
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
bool EchoFuntion(void (*fptr)(void))
 {
   unsigned char i = 100 ;
   do
	 {
	   if(EchoFun()==0x00)
	   break;
	   delay_ms(200);
	 }while(--i);
	 if(i == 0x00)
	 return false;
	 (*fptr)() ;
	 return true;

 }
   /*******************************************************************************
* Function Name  :
* Description    : 餐品数据对比
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char MealDataCompareFunction(void)
 {
   unsigned char i = 100;
   while(i)
   {
    if(MealDataCompareFun()==0x00)
	  return 0 ;
	  --i ;
	  delay_ms(100);
   }
    return 1 ;
 }


unsigned char 	Resend(unsigned char *p,long lenght)
{
	unsigned char Waittimeout = 100 ;
	long Lenght,j;
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	CmdDataSend(p,lenght);	//发送数据
  /*等待数据返回*/
  while(--Waittimeout)
	{
		delay_ms(10);
		if(F_RX1_Right)
		{
		  F_RX1_Right = 0 ;
		  break;
		}
  }
  if(Waittimeout == 0)
    return 1 ;
	Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	if(Lenght == 0x00)/*判断数据长度*/
	  return 1 ;
	for(j=0;j<Lenght+7;j++)
	{
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	{
		if(rx1Buf[7]==0x00)/*是否应答命令*/
		{
		  return 0 ;
		}
		else
		  return 1 ;
//  if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
//	{
//     return 1 ;
//	}
	}
  return 0 ;
}

