jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
 /*******************************************************************************
* 函数名称:HexToChar 		assert_hex_u8print
* 描	述:写入SD卡数据显示转换
* 输	入:char
* 输	出:char
* 返	回:char
* 修改日期:2014年4月14日			MrLAO
*******************************************************************************/

unsigned char HexToChar(unsigned char byTemp)
{
    byTemp &= 0x0f;
    if(byTemp >= 10)     // show 'A' - 'F'
   {
       byTemp = byTemp - 0xa + 0x41;
   }
   else        // show '0' - '9'
   {
       byTemp = byTemp + 0x30;
   }
   return(byTemp);
}


   /*******************************************************************************
 * 函数名称:DataUpload
 * 描    述:数据上传
 *
 * 输    入:无
 * 输    出:无
 * 返    回:void
 * 修改日期:2014年4月4日        ok
 *******************************************************************************/
extern uint8_t Current;
void DataUpload(unsigned char takemeal_flag)
{
  uint8_t cnt_t=0;
	itoa(f_name,TimeDate);	  //把时间转换成字符
	if(UserActMessageWriteToFlash.UserAct.MealID==0x00)
	{
		for(cnt_t=0;cnt_t<10;cnt_t++)
		{
	    printf("upload/UserAct.MealID == %d\r\n",UserActMessageWriteToFlash.UserAct.MealID);
			delay_ms(200);
		}
		while(1);
	}
	MealArr(UserActMessageWriteToFlash.UserAct.MealID);
	/*发送取餐数据给服务器*/
  memset(Record_buffer,0,254);
	if(TakeMealsFun(Record_buffer,takemeal_flag) == 0x01) //表示发送失败
	{
    Sd_Write('n',takemeal_flag);//发送失败
	}
	else
  {
		Sd_Write('y',takemeal_flag);//改变当前最后两位为N0
  }
  UserActMessageWriteToFlash.UserAct.MealID= 0x00;//数据上传还一次对ID清零，这样就可以知道数据是否上传了
}	

 /*******************************************************************************
* Function Name  : 取餐发送数据  OK
* Description    : 取餐发送数据
* Input          : void
* Output         : void
* Return         : void
    08 10 00 0f c0 00 01 24 c9 00 08 00 00 00 00 00 00 00 00 03 e8 47
   //应答码 2位          MAC 8位
*******************************************************************************/

CustomerSel__struction CustomerSel;

char ReadBuf[20]={0};
unsigned char TakeMealsFun1(unsigned char *SendBuffer)
 {
	 char temp[10]={0};
	 
	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j=0;
	 long  CmdLenght = 0 ;
   unsigned char	   Send_Buf[256]={0};	//要发送的数据啦
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 SearchSeparator(ReadBuf,SendBuffer,1); //读取包头
	 StringToHexGroup1(temp,ReadBuf,10);	 
	 /*水流号++*/
	 for(i=0;i<5;i++)
	 {
	  Send_Buf[i] =	temp[i] ;
	 }
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 //GetBRWN();
	 SearchSeparator(ReadBuf,SendBuffer,3); //读取流水号
	 StringToHexGroup1(temp,ReadBuf,14);
	 for(i=0;i<7;i++)
	 {
		 BRWN[3+i]=temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
   
	 SearchSeparator(ReadBuf,SendBuffer,7); /*交易金额*/
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 DealBalance[3+i]=temp[i];
	 } 	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealBalance,sizeof(DealBalance)); /*交易金额(支付金额) */
   
	 SearchSeparator(ReadBuf,SendBuffer,8); //餐品ID
	 StringToHexGroup1(temp,ReadBuf,8); 
   for(i=0;i<4;i++)
   {
		 MealID[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealID,sizeof(MealID)); /*餐品ID*/
   
	 SearchSeparator(ReadBuf,SendBuffer,9); //餐品数量
	 StringToHexGroup1(temp,ReadBuf,2);
 	 MealNO[3]=temp[0];
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealNO,sizeof(MealNO)); /*餐品购买数量*/
   
	 SearchSeparator(ReadBuf,SendBuffer,10); //餐品名字
   for(i=0;i<20;i++)
   {
		 MealName[3+i]=ReadBuf[i];
	 }	
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealName,sizeof(MealName)); /*餐品名字*/
   
	 SearchSeparator(ReadBuf,SendBuffer,11); //餐品价格
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 MealPrice[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));			/*餐品价格*/
   
	 SearchSeparator(ReadBuf,SendBuffer,12); //付款方式
 	 PayType[3]=ReadBuf[0];	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,PayType[2]+3);				/*支付方式*/
   
	 SearchSeparator(ReadBuf,SendBuffer,13); //找零金额
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 Change[3+i]=temp[i];
	 }		 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change)); 			   /*找零金额*/
   
	 SearchSeparator(ReadBuf,SendBuffer,14); //剩余餐品数量
	 StringToHexGroup1(temp,ReadBuf,4); 
   for(i=0;i<4;i++)
   {
		 RemainMealNum[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/
   
	 SearchSeparator(ReadBuf,SendBuffer,15); //取餐标记
	 StringToHexGroup1(temp,ReadBuf,4); 	 
   for(i=0;i<2;i++)
   {
		 TakeMealFlag[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TakeMealFlag,sizeof(TakeMealFlag));  /*取餐标记*/
   
   if(PayType[3]!= '1')//现金的时候不上传下面数据
   {
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,16); //刷卡器终端号
     PosDevNum[2]= strlen(ReadBuf);
     for(i=0;i<PosDevNum[2];i++)
        PosDevNum[3+i]=ReadBuf[i];  //终端号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosDevNum,PosDevNum[2]+3);	
     
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,17); //刷卡器商号号
     PosTenantNum[2]= strlen(ReadBuf);   
     for(i=0;i<PosTenantNum[2];i++)
        PosTenantNum[3+i]=ReadBuf[i];  //商户号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosTenantNum,PosTenantNum[2]+3);
     
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,18); //刷卡器交易流水号    
     PosBatchNum[2]= strlen(ReadBuf); 
     for(i=0;i<PosBatchNum[2];i++)
        PosBatchNum[3+i]=ReadBuf[i];  //流水号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosBatchNum,PosBatchNum[2]+3);
     
     memset(ReadBuf,0,sizeof(ReadBuf));     
     SearchSeparator(ReadBuf,SendBuffer,19); //用户卡号
     PosUserNum[2]= strlen(ReadBuf);  
     for(i=0;i<PosUserNum[2];i++)
        PosUserNum[3+i]= ReadBuf[i];   //卡号  
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosUserNum,PosUserNum[2]+3);    
   }  
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));					  /*MAC*/	 
	 Send_Buf[CmdLenght] = 0x03  ;  //包含数据包包尾标识和CRC校验码
	 CmdLenght+=0x03;
   i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght); //发送数据(取餐交易)
 /***************************************************************************/
	 HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);	/*保存数据的长度*/

