jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
	 if(i == 0x01) /*判断是否超时*/
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 if(Lenght == 0x00)/*判断数据长度*/
	 return 1 ;
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)  //表示正确
	 {
		 if(rx1Buf[7]==0x00)/*是否应答命令*/
		 {
			return 0 ;
		 }
		 if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		 {
			return 1 ;
		 }
	 }
   return 0 ;
 }

char ReadSdBuff[512]={0};
char SendHostBuff[128]={0};
//void DataUpload(void)
//{
//	//读取SD卡中当天的数据
//	//读取第16个','后面的内容
//	//判断是否为'N',是则发送数据
//	//读取第16个','后面的内容
//  unsigned char DelteFlag = 0 ;//用来标记是否全部上传了数据的函数
//	unsigned char Times  = 0  ;
//	RTC_TimeShow();
//	itoa(f_name,TimeDate);	  //把时间转换成字符

//	  do
//	  {
//	     if(Fread(ReadSdBuff)== 0x00)					      //出错记录，然后跳出显示错误
//		   break ;
//    }while(1);
//	SearchSeparator(ReadBuf,ReadSdBuff,17);
//  if(ReadBuf[0]=='N')
//	{
//		 if(TakeMealsFun1(ReadSdBuff)==0);
//		 //在第十六个逗号后写Y
//		 
////		SearchSeparator(ReadBuf,ReadSdBuff,FH); //读取包头
////		memcpy_02(SendHostBuff,ReadBuf,6);
////		SearchSeparator(SendHostBuff,ReadSdBuff,TID); //读取TID
////		//读取Buffer
////		SendDataToHost();
//	}
//	if(ReadBuf[0]=='Y')
//	{
//				
//	}
//}



 /*******************************************************************************
 * 函数名称:StringToHexGroup1                                                                    
 * 描    述:将字符数组转换为hex数组,功能有所修改                                                                  
 *                                                                               
 * 输    入:                                                                   
 * 输    出:bool                                                                      
 * 返    回:void                                                               
 * 修改日期:2013年8月28日  
 *******************************************************************************/
bool StringToHexGroup1(unsigned char *OutHexBuffer, char *InStrBuffer, unsigned int strLength)
{
  unsigned int i, k=0;
  unsigned char HByte,LByte;
//	if(InStrBuffer[strLength-1]!=0x0A)
//		return false;
  for(i=0; i<strLength; i=i+2)
  {
    if(InStrBuffer[i]>='0' && InStrBuffer[i]<='9')
    {
      HByte=InStrBuffer[i]-'0';
    }
    else if(InStrBuffer[i]>='A' && InStrBuffer[i]<='F')
    {
      HByte=InStrBuffer[i]-'A' +10;
    }
    else
    {
      HByte=InStrBuffer[i];
      return false;
    }
    HByte=HByte <<4;
    HByte = HByte & 0xF0;
    if(InStrBuffer[i+1]>='0' && InStrBuffer[i+1]<='9')
    {
       LByte=InStrBuffer[i+1]-'0';
    }
    else if(InStrBuffer[i+1]>='A' && InStrBuffer[i+1]<='F')
    {
       LByte=InStrBuffer[i+1]-'A' +10;
    }
    else
    {
       LByte=InStrBuffer[i];
       return false;
    }
		OutHexBuffer[k++]=HByte |LByte;		
 }
 return true;
}
